
export class GroupsService {

  // groups = [
  //   {
  //     code: 1,
  //     group: 'АСУ-14-1бзу',
  //     type: 'заочная',
  //     program: 'программа бакалавриата',
  //     date_exam: [ '2017-11-30' ],
  //     date_qualify_work: [ '2018-02-05' ]
  //   }, {
  //     code: 2,
  //     group: 'ЭВТ-14-1бзу',
  //     type: 'заочная',
  //     program: 'программа бакалавриата',
  //     date_exam: [ '2017-11-30' ],
  //     date_qualify_work: [ '2018-02-06' ]
  //   }, {
  //     code: 3,
  //     group: 'РИС-14-1бзу',
  //     type: 'заочная',
  //     program: 'программа бакалавриата',
  //     date_exam: [ '2017-12-13' ],
  //     date_qualify_work: [ '2018-02-05' ]
  //   }, {
  //     code: 4,
  //     group: 'АСУ1-16-1м',
  //     type: 'очная',
  //     program: 'программа магистратуры',
  //     date_exam: [ '2018-05-29' ],
  //     date_qualify_work: [ '2018-07-02' ]
  //   }, {
  //     code: 5,
  //     group: 'АСУ2-16-1м',
  //     type: 'очная',
  //     program: 'программа магистратуры',
  //     date_exam: [ '2018-05-30', '2018-05-31' ],
  //     date_qualify_work: [ '2018-07-03', '2018-07-04' ]
  //   }, {
  //     code: 6,
  //     group: 'АСУ3-16-1м',
  //     type: 'очная',
  //     program: 'программа магистратуры',
  //     date_exam: [ '2018-06-01' ],
  //     date_qualify_work: [ '2018-07-05' ]
  //   }, {
  //     code: 7,
  //     group: 'РИС-16-1м',
  //     type: 'очная',
  //     program: 'программа магистратуры',
  //     date_exam: [ '2018-05-29', '2018-05-30' ],
  //     date_qualify_work: [ '2018-07-03', '2018-07-04' ]
  //   }, {
  //     code: 8,
  //     group: 'АСУ-14-1б',
  //     type: 'очная',
  //     program: 'программа бакалавриата',
  //     date_exam: [ '2018-05-29', '2018-05-30', '2018-05-31' ],
  //     date_qualify_work: [ '2018-07-02', '2018-07-03', '2018-07-04' ]
  //   }, {
  //     code: 9,
  //     group: 'ЭВТ-14-1б',
  //     type: 'очная',
  //     program: 'программа бакалавриата',
  //     date_exam: [ '2018-05-31', '2018-06-01' ],
  //     date_qualify_work: [ '2018-07-04', '2018-07-05' ]
  //   }, {
  //     code: 10,
  //     group: 'РИС-14-1б',
  //     type: 'очная',
  //     program: 'программа бакалавриата',
  //     date_exam: [ '2018-05-29', '2018-05-31' ],
  //     date_qualify_work: [ '2018-07-02', '2018-07-03' ]
  //   }, {
  //     code: 11,
  //     group: 'АСУ-13-1бз',
  //     type: 'заочная',
  //     program: 'программа бакалавриата',
  //     date_exam: [ '2018-05-10', '2018-05-11' ],
  //     date_qualify_work: [ '2018-06-25', '2018-06-26' ]
  //   }, {
  //     code: 12,
  //     group: 'АСУ-13бзЧФ',
  //     type: 'заочная',
  //     program: 'программа бакалавриата',
  //     date_exam: [ '2018-05-11' ],
  //     date_qualify_work: [ '2018-06-26' ]
  //   }
  // ];

}
